openfoam_ex/step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0.5 0)
    (0.5 0.5 0)
    (0.5 0 0)
    (5 0 0)
    (5 0.5 0)
    (5 1 0)
    (0.5 1 0)
    (0 1 0)

    (0 0.5 0.1)
    (0.5 0.5 0.1)
    (0.5 0 0.1)
    (5 0 0.1)
    (5 0.5 0.1)
    (5 1 0.1)
    (0.5 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (10 10 1) simpleGrading (1 1 1)

    hex (1 4 5 6 9 12 13 14) (100 10 1) simpleGrading (1 1 1)

    hex (2 3 4 1 10 11 12 9) (100 10 1) simpleGrading (1 1 1)
);


edges
(
);

boundary
(
    inflow
    {
        type patch;
        faces
        (
            (0 8 15 7)
        );
    }
    outflow
    {
        type patch;
        faces
        (
            (3 11 12 4)
            (4 5 13 12)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 8 9 1)
            (2 10 9 1)
            (2 10 11 3)
            (6 14 13 5)
            (6 7 15 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 6 7)
            (1 4 5 6)
            (2 3 4 1)
            (9 10 11 12)
            (9 12 13 14)
            (8 9 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
